benhofflich/Nordic/nRF5_SDK_17.1.0_ddde560/examples/My Projects/BLE Max Test 12-1-21/main.c
#define DEAD_BEEF                           0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint8_t mode;

BLE_APNEAS_DEF(m_apneas);                                                 /**< Heart rate service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                 /**< Advertising module instance. */
APP_TIMER_DEF(m_meas_timer_id);                               /**< Heart rate measurement timer. */

static uint16_t m_conn_handle         = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[] =                                   /**< Universally unique service identifiers. */
{
    {BLE_UUID_HEART_RATE_SERVICE,           BLE_UUID_TYPE_BLE},
    {BLE_UUID_PLX_SERVICE       ,           BLE_UUID_TYPE_BLE},
    {BLE_UUID_GLUCOSE_SERVICE   ,           BLE_UUID_TYPE_BLE}
};

bioData body;


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code;

        err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}



/**@brief Function for handling the Heart rate measurement timer timeout.
 *
 * @details This function will be called each time the heart rate measurement timer expires.
 *          It will exclude RR Interval data from every third measurement.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void meas_timeout_handler(void * p_context)
{
    ret_code_t      err_code;
    uint16_t        heart_rate = 0;
    uint16_t        oxygen     = 0;
    uint32_t        red        = 0;
    uint32_t        infrared   = 0;

    uint16_t         accX       = 0;
    uint16_t         accY       = 0;
    uint16_t         accZ       = 0;

    UNUSED_PARAMETER(p_context);

    switch(mode){
      case 0:
      body = readBpm();
      heart_rate = (uint16_t)body.heartRate;
      oxygen = (uint16_t)body.oxygen;
      break;
      
      case 1:
      body = readSensor();
      red = (uint32_t)body.redLed;
      infrared = (uint32_t)body.irLed;
      break;

      case 2:
      body = readSensorBpm();
      heart_rate = (uint16_t)body.heartRate;
      oxygen = (uint16_t)body.oxygen;
      red = (uint32_t)body.redLed;
      infrared = (uint32_t)body.irLed;
      break;

      default:
      break;
    }

    readAccelSamples(&accX, &accY, &accZ);

    if(heart_rate<<8 != 0){
      err_code = ble_apneas_heart_rate_measurement_send(&m_apneas, heart_rate);
      if ((err_code != NRF_SUCCESS) &&
          (err_code != NRF_ERROR_INVALID_STATE) &&
          (err_code != NRF_ERROR_RESOURCES) &&
          (err_code != NRF_ERROR_BUSY) &&
          (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
         )
      {
          APP_ERROR_HANDLER(err_code);
      }
    }

    if(oxygen<<8 != 0){
      err_code = ble_apneas_oxygen_measurement_send(&m_apneas, oxygen);
      if ((err_code != NRF_SUCCESS) &&
          (err_code != NRF_ERROR_INVALID_STATE) &&
          (err_code != NRF_ERROR_RESOURCES) &&
          (err_code != NRF_ERROR_BUSY) &&
          (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
         )
      {
          APP_ERROR_HANDLER(err_code);
      }
    }

    if(red<<24 != 0){
      err_code = ble_apneas_red_counter_measurement_send(&m_apneas, red);
      if ((err_code != NRF_SUCCESS) &&
          (err_code != NRF_ERROR_INVALID_STATE) &&
          (err_code != NRF_ERROR_RESOURCES) &&
          (err_code != NRF_ERROR_BUSY) &&
          (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
         )
      {
          APP_ERROR_HANDLER(err_code);
      }
    }

    if(infrared<<24 != 0){
      err_code = ble_apneas_infrared_measurement_send(&m_apneas, infrared);
      if ((err_code != NRF_SUCCESS) &&
          (err_code != NRF_ERROR_INVALID_STATE) &&
          (err_code != NRF_ERROR_RESOURCES) &&
          (err_code != NRF_ERROR_BUSY) &&
          (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
         )
      {
          APP_ERROR_HANDLER(err_code);
      }
    }

    err_code = ble_apneas_accel_measurement_send(&m_apneas, accX, accY, accZ);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

